symbolmap = {}

symbolmap['a'] = """
 *** 
*   *
*   *
*****
*   *
*   *
*   *
"""
symbolmap['b'] = """
**** 
*   *
*   *
**** 
*   *
*   *
**** 
"""
symbolmap['c'] = """
 *** 
*   *
*    
*    
*    
*   *
 *** 
"""

symbolmap['d'] = """
****  
*   * 
*   * 
*   * 
*   * 
*   * 
****  
"""

symbolmap['e'] = """
*****
*    
*    
***  
*    
*    
*****
"""

symbolmap['f'] = """
*****
*    
*    
***  
*    
*    
*    
"""

symbolmap['g'] = """
 *** 
*   *
*    
*  **
*   *
*   *
 *** 
"""
symbolmap['h'] = """
*   * 
*   * 
*   * 
***** 
*   * 
*   * 
*   *
"""

symbolmap['i'] = """
  ***
   * 
   * 
   * 
   * 
   * 
  ***
"""
symbolmap['j'] ="""
 ***
  * 
  * 
  * 
  * 
  * 
**  
"""
symbolmap['k'] ="""
*   *
*  * 
* *  
**   
* *  
*  * 
*   *
"""
symbolmap['l'] ="""
 *    
 *    
 *    
 *    
 *    
 *    
 *****
"""
symbolmap['m'] ="""
 *   *
 *   *
 ** **
 * * *
 *   *
 *   *
 *   *
"""
symbolmap['n'] ="""
*   *
*   *
**  *
* * *
*  **
*   *
*   *
"""
symbolmap['o'] ="""
 *** 
*   *
*   *
*   *
*   *
*   *
 *** 
"""
symbolmap['p'] ="""
****
*   *
*   *
****
*
*
*
"""
symbolmap['q'] ="""
  ***   
 *   *  
 *   *   
 *   *    
 *   *    
 *  *   
  ** * 
"""
symbolmap['r'] ="""
****    
*   *   
*   *    
****      
* *       
*  *    
*   *  
"""
symbolmap['s'] ="""
 ****
*    
*    
 *** 
    *
    *
 *** 
"""
symbolmap['t'] ="""
*****
  *  
  *  
  *  
  *  
  *  
  *  
"""
symbolmap['u'] ="""
*   *
*   *
*   *
*   *
*   *
*   *
 *** 
"""
symbolmap['v'] ="""
*   *
*   *
*   *
*   * 
*   * 
 * * 
  *  
"""
symbolmap['w'] ="""
*   *
*   *
*   *
* * *
** **
*   *
*   *
"""
symbolmap['x'] ="""
*   *    
*   *    
 * *      
  *        
 * *       
*   *    
*   *   
"""

symbolmap['y'] ="""
 *   *
 *   *
  * * 
   *  
   *  
   *  
   *  
"""
symbolmap['z'] ="""
*****
    *
   *
  *
 *
*
*****  
"""

a = list(input("Ввветіть своє прізвіще англійською: "))

for s in a:
    print(symbolmap[s.lower()])